network_basics/ref.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-07-16 Mon 18:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Computer Networks Textbooks and References</title>
<meta name="generator" content="Org mode">
<meta name="author" content="WANG Xiaolin">
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>
<div id="content">
<h1 class="title">Computer Networks Textbooks and References</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3e3c657">1. Textbooks</a></li>
<li><a href="#org5d0cb9f">2. References</a>
<ul>
<li><a href="#org9795416">2.1. Online Course</a></li>
<li><a href="#orgab57bd8">2.2. Wikipedia</a></li>
<li><a href="#org7cfa94c">2.3. RFC</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3e3c657" class="outline-2">
<h2 id="org3e3c657"><span class="section-number-2">1</span> Textbooks</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Andrew S. Tanenbaum, <a href="https://cs3.swfu.edu.cn/tech/get/PDF/29/Calibre1"><i>Computer Networks, 5e</i></a>, Prentice Hall, 2011.</li>
<li>W. Richard Stevens, <a href="https://cs3.swfu.edu.cn/tech/get/PDF/32/Calibre1"><i>TCP/IP Illustrated, Volume 1, The Protocols</i></a>,
Addison-Wesley, 1994.</li>
<li>Kurose, Ross, <a href="https://cs3.swfu.edu.cn/tech/get/PDF/27/Calibre1"><i>Computer Networking - A Top-Down Approach, 6e</i></a>, Addison-Wesley, 2011.</li>
</ol>
</div>
</div>

<div id="outline-container-org5d0cb9f" class="outline-2">
<h2 id="org5d0cb9f"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9795416" class="outline-3">
<h3 id="org9795416"><span class="section-number-3">2.1</span> Online Course</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Cisco, <a href="https://www.netacad.com/"><i>Cisco Networking Academy</i></a>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgab57bd8" class="outline-3">
<h3 id="orgab57bd8"><span class="section-number-3">2.2</span> Wikipedia</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="http://en.wikipedia.org/wiki/Internet_protocol_suite">Internet protocol suite</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7cfa94c" class="outline-3">
<h3 id="org7cfa94c"><span class="section-number-3">2.3</span> RFC</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://www.ietf.org/rfc/rfc1180.txt">rfc1180</a> - A TCP/IP Tutorial</li>
<li><a href="http://www.rfc-editor.org/rfc/rfc1122.txt">rfc1122</a> - Requirements for Internet Hosts &#x2013; Communication Layers</li>
<li><a href="http://www.rfc-editor.org/rfc/rfc1123.txt">rfc1123</a> - Requirements for Internet Hosts &#x2013; Application and Support</li>
<li><a href="https://www.ietf.org/rfc/rfc791.txt">rfc791</a> - Internet Protocol</li>
<li><a href="https://www.ietf.org/rfc/rfc793.txt">rfc793</a> - Transmission Control Protocol</li>
<li><a href="https://www.ietf.org/rfc/rfc2460.txt">rfc2460</a> - IPv6</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: WANG Xiaolin</p>
<p class="date">Created: 2018-07-16 Mon 18:23</p>
<p class="creator">Emacs 25.2.2 (Org mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
